#include <iostream>
using namespace std;
int main() {
	setlocale(0, "");

	double a1, b1, a2, b2, a3, b3,s1,s2,s3;
	cout << "¬ведите стороны 1 пр€моугольника" << endl;
	cin >> a1 >> b1;
	cout << "¬ведите стороны 2 пр€моугольника" << endl;
	cin >> a2 >> b2;
	cout << "¬ведите стороны 3 пр€моугольника" << endl;
	cin >> a3 >> b3;
	s1 = a1 * b1;
	s2 = a2 * b2;
	s3 = a3 * b3;
	if (s1 > s2 && s1>s3) cout <<"наибольша€ площадь равна = " << s1<<endl;
	if (s2 > s1 && s2 > s3) cout <<"наибольша€ площадь равна = "<<s2<<endl;
	if (s3 > s1 && s3 > s2) cout << "наибольша€ площадь равна =" << s3<<endl;
	// 2 способ через тернарнуюю операцию
	/*
	double a1,a2,a3,b1,b2,b3,s1,s2,s3;
	double a1, b1, a2, b2, a3, b3,s1,s2,s3;

	cout << "¬ведите стороны 1 пр€моугольника" << endl;
	cin >> a1 >> b1;
	cout << "¬ведите стороны 2 пр€моугольника" << endl;
	cin >> a2 >> b2;
	cout << "¬ведите стороны 3 пр€моугольника" << endl;
	cin >> a3 >> b3;
	
	s1 = a1*b1
	s2 = a2*b2
	s3 = a3*b3
	
	
	
	*/


	// через макс
	
	
	/*
	double a1,a2,a3,b1,b2,b3,s1,s2,s3;
	double a1, b1, a2, b2, a3, b3,s1,s2,s3;

	cout << "¬ведите стороны 1 пр€моугольника" << endl;
	cin >> a1 >> b1;
	cout << "¬ведите стороны 2 пр€моугольника" << endl;
	cin >> a2 >> b2;
	cout << "¬ведите стороны 3 пр€моугольника" << endl;
	cin >> a3 >> b3;
	
	s1 = a1*b1;
	s2 = a2*b2;
	s3 = a3*b3;
	cout<<"максимальна€ площадь равна = "<< max(s1, max(s2,s3);
	*/
}